game-bot/src/InformationRegisters/СтатусыПоискКино/СтатусыПоискКино.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПоискКино</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПоискКино</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиТелеграм</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

game-bot/src/CommonModules/РаботаСоСтатусом/Module.bsl
//@skip-check constructor-function-return-section
#Область ПрограммныйИнтерфейс
// Возвращает статус и дополнительные данные пользователя из регистра сведений.
//
// Параметры:
//   Отправитель - СправочникСсылка.УчетныеЗаписиТелеграм - учетная запись пользователя
//
// Возвращаемое значение:
//   Структура - с ключами "Статус" и "ДополнительныеДанные" или Неопределено
Функция СтатусОтправителя(Отправитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыПоискКино.Статус КАК Статус,
		|	СтатусыПоискКино.ДополнительныеДанные КАК ДополнительныеДанные
		|ИЗ
		|	РегистрСведений.СтатусыПоискКино КАК СтатусыПоискКино
		|ГДЕ
		|	СтатусыПоискКино.УчетнаяЗапись = &УчетнаяЗапись";
		
	Запрос.УстановитьПараметр("УчетнаяЗапись", Отправитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Статус", Выборка.Статус);
		Результат.Вставить("ДополнительныеДанные", Выборка.ДополнительныеДанные);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Записывает в регистр сведений новый статус для учетной записи с возможностью сохранения дополнительных данных.
//
// Параметры:
//   Отправитель - СправочникСсылка.УчетныеЗаписиТелеграм - Учетная запись, для которой устанавливается статус
//   Статус - ПеречислениеСсылка.СтатусыПоискКино - Устанавливаемый статус
//   ДополнительныеДанные - ХранилищеЗначения - Произвольные данные, сохраняемые в хранилище значений
Процедура УстановитьСтатус(Отправитель, Статус, ДополнительныеДанные = Неопределено) Экспорт
	
	Запись = РегистрыСведений.СтатусыПоискКино.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = Отправитель;
	Запись.Статус = Статус;
	Если ДополнительныеДанные <> Неопределено Тогда
		Запись.ДополнительныеДанные = Новый ХранилищеЗначения(ДополнительныеДанные);
	КонецЕсли;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти
